# GetAnalyzeAs Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..GetAnalyzeAs Method
AnalyticalModel Class See Also
---
Returns value of Analyze As parameter for Analytical Model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyzeAs GetAnalyzeAs()
```

Visual Basic
---
```text
Public Function GetAnalyzeAs As AnalyzeAs
```

Visual C++
---
```text
public:
AnalyzeAs GetAnalyzeAs()
```

# ### Return Value
AnalyzeAs enumeration, indicating how Analytical Model is analyzed.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace